In [23]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [24]:
df = pd.read_csv('/Users/saptarshipal/DATA/ipl_dataset2013/IPL IMB381IPL2013.csv')
df.head()

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,...,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,...,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,Bowler,571,58,1269,80.62,...,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,Bowler,284,31,241,84.56,...,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,Batsman,63,0,79,45.93,...,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

In [25]:
df.columns

Index(['Sl.NO.', 'PLAYER NAME', 'AGE', 'COUNTRY', 'TEAM', 'PLAYING ROLE',
       'T-RUNS', 'T-WKTS', 'ODI-RUNS-S', 'ODI-SR-B', 'ODI-WKTS', 'ODI-SR-BL',
       'CAPTAINCY EXP', 'RUNS-S', 'HS', 'AVE', 'SR-B', 'SIXERS', 'RUNS-C',
       'WKTS', 'AVE-BL', 'ECON', 'SR-BL', 'AUCTION YEAR', 'BASE PRICE',
       'SOLD PRICE'],
      dtype='object')

In [26]:
df1 = df.copy()
df1.drop(columns='Sl.NO.', axis =1, inplace = True)

In [27]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 25 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PLAYER NAME    130 non-null    object
 1   AGE            130 non-null    int64
 2   COUNTRY        130 non-null    object
 3   TEAM           130 non-null    object
 4   PLAYING ROLE   130 non-null    object
 5   T-RUNS         130 non-null    int64
 6   T-WKTS         130 non-null    int64
 7   ODI-RUNS-S     130 non-null    int64
 8   ODI-SR-B       130 non-null    float64
 9   ODI-WKTS       130 non-null    int64
 10  ODI-SR-BL      130 non-null    float64
 11  CAPTAINCY EXP  130 non-null    int64
 12  RUNS-S         130 non-null    int64
 13  HS             130 non-null    int64
 14  AVE            130 non-null    float64
 15  SR-B           130 non-null    float64
 16  SIXERS         130 non-null    int64
 17  RUNS-C         130 non-null    int64
 18  WKTS           130 non-null    int64
 19  AVE-BL         130 non-null    float64
 20  ECON           130 non-null    float64
 21  SR-BL          130 non-null    float64
 22  AUCTION YEAR   130 non-null    int64
 23  BASE PRICE     130 non-null    int64
 24  SOLD PRICE     130 non-null    int64
dtypes: float64(7), int64(14), object(4)
memory usage: 25.5+ KB

In [28]:
df1.shape

(130, 25)

In [29]:
df1.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
AGE,130.0,2.092308,0.576627,1.0,2.0000,2.000,2.0000,3.00
T-RUNS,130.0,2166.715385,3305.646757,0.0,25.5000,542.500,3002.2500,15470.00
T-WKTS,130.0,66.530769,142.676855,0.0,0.0000,7.000,47.5000,800.00
ODI-RUNS-S,130.0,2508.738462,3582.205625,0.0,73.2500,835.000,3523.5000,18426.00
ODI-SR-B,130.0,71.164385,25.898440,0.0,65.6500,78.225,86.7900,116.66
ODI-WKTS,130.0,76.076923,111.205070,0.0,0.0000,18.500,106.0000,534.00
ODI-SR-BL,130.0,34.033846,26.751749,0.0,0.0000,36.600,45.3250,150.00
CAPTAINCY EXP,130.0,0.315385,0.466466,0.0,0.0000,0.000,1.0000,1.00
RUNS-S,130.0,514.246154,615.226335,0.0,39.0000,172.000,925.2500,2254.00
HS,130.0,47.430769,36.403624,0.0,16.0000,35.500,73.7500,158.00
AVE,130.0,18.719308,11.094224,0.0,9.8250,18.635,27.8725,50.11
SR-B,130.0,111.053462,35.928907,0.0,98.2375,118.510,129.1025,235.49
SIXERS,130.0,17.692308,23.828146,0.0,1.0000,6.000,29.7500,129.00
RUNS-C,130.0,475.523077,558.314049,0.0,0.0000,297.000,689.2500,1975.00
WKTS,130.0,17.169231,21.816763,0.0,0.0000,8.500,23.7500,83.00
AVE-BL,130.0,23.110231,20.802057,0.0,0.0000,24.785,35.5800,126.30
ECON,130.0,6.204462,4.941531,0.0,0.0000,7.380,8.2475,38.11
SR-BL,130.0,17.382615,15.273422,0.0,0.0000,19.935,26.2125,100.20
AUCTION YEAR,130.0,2009.092308,1.377821,2008.0,2008.0000,2008.000,2011.0000,2011.00
BASE PRICE,130.0,192230.769231,153097.300897,20000.0,100000.0000,200000.000,225000.0000,1350000.00
SOLD PRICE,130.0,521223.076923,406807.351419,20000.0,225000.0000,437500.000,700000.0000,1800000.00

In [30]:
#set the no.of columns on display

#pd.set_option('display.max_columns',7)

In [31]:
df1.head()

,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,ODI-WKTS,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,0,...,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,185,...,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,"Agarkar, AB",2,IND,KKR,Bowler,571,58,1269,80.62,288,...,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,"Ashwin, R",1,IND,CSK,Bowler,284,31,241,84.56,51,...,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,"Badrinath, S",2,IND,CSK,Batsman,63,0,79,45.93,0,...,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

In [32]:
type(list(df1.columns))

list

In [33]:
df1[0:5]

,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,ODI-WKTS,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,0,...,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,185,...,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,"Agarkar, AB",2,IND,KKR,Bowler,571,58,1269,80.62,288,...,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,"Ashwin, R",1,IND,CSK,Bowler,284,31,241,84.56,51,...,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,"Badrinath, S",2,IND,CSK,Batsman,63,0,79,45.93,0,...,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

In [34]:
#negative indexing

df1[-5:]

,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,ODI-WKTS,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
125,"Yadav, AS",2,IND,DC,Batsman,0,0,0,0.00,0,...,125.64,2,0,0,0.00,0.00,0.00,2010,50000,750000
126,Younis Khan,2,PAK,RR,Batsman,6398,7,6814,75.78,3,...,42.85,0,0,0,0.00,0.00,0.00,2008,225000,225000
127,Yuvraj Singh,2,IND,KXIP+,Batsman,1775,9,8051,87.58,109,...,131.88,67,569,23,24.74,7.02,21.13,2011,400000,1800000
128,Zaheer Khan,2,IND,MI+,Bowler,1114,288,790,73.55,278,...,91.67,1,1783,65,27.43,7.75,21.26,2008,200000,450000
129,"Zoysa, DNT",2,SL,DC,Bowler,288,64,343,95.81,108,...,122.22,0,99,2,49.50,9.00,33.00,2008,100000,110000

In [35]:
df1['PLAYER NAME'][0:5]

0     Abdulla, YA
1    Abdur Razzak
2     Agarkar, AB
3       Ashwin, R
4    Badrinath, S
Name: PLAYER NAME, dtype: object

In [36]:
df1[['PLAYER NAME','COUNTRY']][0:5]

    PLAYER NAME COUNTRY
0   Abdulla, YA      SA
1  Abdur Razzak     BAN
2   Agarkar, AB     IND
3     Ashwin, R     IND
4  Badrinath, S     IND

In [42]:
df1.iloc[0:5,2:7]

  COUNTRY  TEAM PLAYING ROLE  T-RUNS  T-WKTS
0      SA  KXIP   Allrounder       0       0
1     BAN   RCB       Bowler     214      18
2     IND   KKR       Bowler     571      58
3     IND   CSK       Bowler     284      31
4     IND   CSK      Batsman      63       0

In [43]:
df1.COUNTRY.value_counts()

IND    53
AUS    22
SA     16
SL     12
PAK     9
NZ      7
WI      6
ENG     3
BAN     1
ZIM     1
Name: COUNTRY, dtype: int64

In [44]:
pd.crosstab(df1['AGE'],df1['PLAYING ROLE'])

PLAYING ROLE  Allrounder  Batsman  Bowler  W. Keeper
AGE
1                      4        5       7          0
2                     25       21      29         11
3                      6       13       8          1

In [46]:
df1[['PLAYER NAME','SOLD PRICE']].sort_values('SOLD PRICE')[0:5]

       PLAYER NAME  SOLD PRICE
73      Noffke, AA       20000
46     Kamran Khan       24000
0      Abdulla, YA       50000
1     Abdur Razzak       50000
118  Van der Merwe       50000

In [47]:
df1[['PLAYER NAME','SOLD PRICE']].sort_values('SOLD PRICE',ascending = False)[0:5]

       PLAYER NAME  SOLD PRICE
93       Sehwag, V     1800000
127   Yuvraj Singh     1800000
50        Kohli, V     1800000
111  Tendulkar, SR     1800000
113     Tiwary, SS     1600000

In [48]:
df1['premium'] = df1['SOLD PRICE'] - df1['BASE PRICE']
df1[['SOLD PRICE','BASE PRICE','premium']].sort_values('SOLD PRICE', ascending = False)[0:5]

     SOLD PRICE  BASE PRICE  premium
93      1800000      400000  1400000
127     1800000      400000  1400000
50      1800000      150000  1650000
111     1800000      400000  1400000
113     1600000      100000  1500000